#+TITLE: AP Java Programming Introduction
#+AUTHOR: Scott Runnels
#+LANGUAGE: en
#+EXPORT_FILE_NAME: classes-and-objects.pdf
#+OPTIONS:   H:2 num:t toc:t \n:nil @:t ::t |:t ^:nil -:nil f:t *:t <:t 
#+BIND: org-latex-caption-above nil
#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [presentation]
#+LaTeX_CLASS_OPTIONS: [aspectratio=169]
#+COLUMNS: %45ITEM %10BEAMER_env(Env) %10BEAMER_act(Act) %4BEAMER_col(Col) %8BEAMER_opt(Opt)
#+COLUMNS: %20ITEM %13BEAMER_env(Env) %6BEAMER_envargs(Args) %4BEAMER_col(Col) %7BEAMER_extra(Extra)
#+BEAMER_THEME: metropolis
# #+BEAMER_OUTER_THEME: miniframes [subsection=false]
#+BEAMER_HEADER: \subtitle{Classes and Objects}
# #+BEAMER_HEADER: \AtBeginSection[]{
# This line inserts a table of contents with the current section highlighted at
# the beginning of each section
# #+BEAMER_HEADER: \begin{frame}<beamer>\frametitle{Topic}\tableofcontents[currentsection]\end{frame}
# In order to have the miniframes/smoothbars navigation bullets even though we do not use subsections 
# q.v. https://tex.stackexchange.com/questions/2072/beamer-navigation-circles-without-subsections/2078#2078
# #+BEAMER_HEADER: \subsection{}
# #+BEAMER_HEADER: }
#+LATEX_HEADER: \definecolor{myblue}{RGB}{20,105,176}
#+LATEX_HEADER: \usepackage{listings}
#+LATEX_HEADER: \usepackage{minted}
#+LATEX_HEADER: \usepackage[listings, many]{tcolorbox}
#+LATEX_HEADER: \usepackage{tabularx}
#+LATEX_HEADER: \usepackage{etoolbox}
#+LATEX_HEADER: \usepackage{local-style}
#+LATEX_HEADER: \BeforeBeginEnvironment{minted}{\begin{tcolorbox}[enhanced,colframe=myblue,boxrule=1pt,boxsep=1pt,left=1pt,right=1pt,top=-0pt,bottom=0pt,arc=0pt,toprule=0pt, rightrule=0pt,colback=white,attach boxed title to top left={yshift=-0pt},title=Code,boxed title style={colback=myblue, right=0mm, bottomrule=0pt, left=0mm, arc=0pt}, fonttitle=\tiny]}%
#+LATEX_HEADER: \AfterEndEnvironment{minted}{\end{tcolorbox}}%
#+LATEX_HEADER: \usepackage{parskip}
*** LEFT                                                              :BMCOL:
    :PROPERTIES:
    :BEAMER_col: 0.5
    :BEAMER_opt: t
    :END:
    #+ATTR_LATEX: :options numbersep=5pt,linenos,breaklines=true,fontsize=\tiny,highlightlines={11,12}
    #+name: public-example
    #+begin_src java :results output :exports code
      class Main {
          public static void main (String[] args){
              Book book01 = new Book("Last of the Sandwalkers");
              System.out.println("Added " + book01.title);
              book01.title = "First of the Sandwalkers";
              System.out.println("Now it's " + book01.title);
          }
      }

      class Book {
          public String title;
          public String author;

          public Book (String bookTitle) {
              title = bookTitle;
          }
      }
    #+end_src

    #+RESULTS: public-example
    : Added Last of the Sandwalkers
    : The book is now called First of the Sandwalkers

*** LEFT                                                              :BMCOL:
    :PROPERTIES:
    :BEAMER_col: 0.5
    :BEAMER_opt: t
    :END:
    #+ATTR_LATEX: :options numbersep=5pt,linenos,breaklines=true,fontsize=\tiny,highlightlines={9,10}
    #+name: private-example
    #+begin_src java :results output :exports code
      class Main {
          public static void main (String[] args){
              Book book01 = new Book("Last of the Sandwalkers");
              // This would create an error
              // System.out.println(book01.title); 
              System.out.println("Added " + book01.getTitle());
          }
      }

      class Book {
          private String title;

          public Book (String bookTitle) {
              title = bookTitle;
          }
          /* Accessor Method */
          public String getTitle(){
              return title;
          }
      }
    #+end_src

    #+RESULTS: private-example
    : Total Books: 0

*** LEFT                                                              :BMCOL:
    :PROPERTIES:
    :BEAMER_col: 0.5
    :BEAMER_opt: t
    :END:
    #+ATTR_LATEX: :options numbersep=5pt,linenos,breaklines=true,fontsize=\tiny,highlightlines={12}
    #+name: static-example
    #+begin_src java :results output :exports code
      class Main {
          public static void main (String[] args){
              Book book01 = new Book("Last of the Sandwalkers");
              System.out.println("Total Books: " + book01.total);
              Book book02 = new Book("Zita the Spacegirl");
              System.out.println("Total Books: " + book01.total);
          }
      }

      class Book {
          private String title;
          public static int total = 0;
          public Book (String bookTitle) {
              title = bookTitle;
              total++;
          }
          /* Accessor Method */
          public String getTitle(){
              return title;
          }
      }
    #+end_src

    #+RESULTS: static-example
    : Total Books: 1
    : Total Books: 2

